ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create

    @cat = Cat.new(cat_params)

    #redirect to show (once we make the cat, it shows you the page with the cat on it)
    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "notjj"], ["description", "   he's the worst "], ["updated_at", "2018-09-12 00:01:45.524926"], ["id", 7]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)